textDict_raw={}

for word in finalTexts:
    if word not in textDict_raw:
        textDict_raw[word]=1
    else:
        textDict_raw[word]+=1
print(textDict_raw)
#{'애견': 2017, '애견카페': 1455, '카페': 1957, '나들이': 24, '군산': 3, '지': 32, '얼마': 33, '요기': 7, '요기조기': 1, '조기': 1, '중': 158, '탐방': 3, '곳': 344, '김': 37, '대형': 92, '대형애견카페': 1, '좋으': 8, '수도권': 7, '인지': 9, '상대적': 3, '가격': 26, '군': 34, '산': 49, '근교': 19...

textDictraw_sorted = sorted(textDict_raw.items(), key=lambda x:x[1], reverse=True)
print(textDictraw_sorted)
#[('애견', 2017), ('카페', 1957), ('하', 1714), ('있', 1540), ('애견카페', 1455), ('되', 594), ('가', 582), ('강아지', 507), ('놀', 434), ('보', 406), ('수', 405), ('오', 374), ('동반', 369), ('곳', 344), ('추천', 317), ('갈', 286), ('시', 282), ('다녀오', 273),...